БухЭксп/InformationRegisters/CW_ПрочитанныеУведомления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПрочитанныеУведомления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Уведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_УведомленияСайта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_УведомленияСайта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_УведомленияСайта</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Релиз</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеHTML</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_УведомленияСайтаСервер/Ext/Module.bsl
Процедура УдалениеУстаревшихУведомлений(АдресРезультата=Неопределено) Экспорт
	
	//УстановитьБезопасныйРежим(Истина);
	
	Версия = "";

	ОписаниеПодсистем = Новый Структура;
	CW_БухгалтерияЭкспедитораСервер.ПриДобавленииПодсистем(ОписаниеПодсистем);
	ОписаниеПодсистем.Свойство("CW_БухгалтерияЭкспедитора",Версия); 

	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Пользователь", 	ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Версия", 		Версия);

	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_УведомленияСайта.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_УведомленияСайта КАК CW_УведомленияСайта
	               |ГДЕ
	               |	CW_УведомленияСайта.ПометкаУдаления = ЛОЖЬ
	               |	И CW_УведомленияСайта.Версия <> &Версия";
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий()Цикл  
		УведомленияСайтаОбъект = Выборка.Ссылка.получитьОбъект();
		УведомленияСайтаОбъект.Удалить();
	КонецЦикла;
	
КонецПроцедуры


Процедура CW_ЗагрузитьУведомленияРегламент() Экспорт
	
	ЗагрузитьУведомления();
	
КонецПроцедуры

Процедура ЗагрузитьУведомления(ПараметрыПроцедуры = Неопределено, АдресРезультата = Неопределено) Экспорт
	
   УстановитьПривилегированныйРежим(Истина);
	
   КороткоеИмя = CW_ОбновлениеКонфигурацииСервер.ПолучитьКороткоеИмяКонфигурации();   
   ИмяФайла 	= ПолучитьИмяФайлаУведомлений();   
   
   Уведомления_ИмяХоста 	= "www.coralway.ru";
   Уведомления_ПутьКФайлу 	= "/products/programs_cw/"+КороткоеИмя+"/Messages/"+ИмяФайла;
   
   ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");
   
   Попытка
	   Соединение = Новый HTTPСоединение(Уведомления_ИмяХоста);
	   Соединение.Получить(Уведомления_ПутьКФайлу, ИмяВременногоФайла);
   Исключение
	   ЗаписьЖурналаРегистрации("УведомленияСайта",УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.CW_УведомленияСайта,, ОписаниеОшибки());
	   Возврат;
   КонецПопытки;
   
   ТекстовыйДокумент = новый ТекстовыйДокумент;
   ТекстовыйДокумент.Прочитать(ИмяВременногоФайла, КодировкаТекста.UTF8);
   
   СтрокаJSON = ТекстовыйДокумент.ПолучитьТекст();
   
   ЧтениеJSON = Новый ЧтениеJSON;
   ЧтениеJSON.УстановитьСтроку(СтрокаJSON);  
   
   СоответствиеУведомлений = ПрочитатьJSON(ЧтениеJSON, Истина);
   ЧтениеJSON.Закрыть();  
   
   Для Каждого КлючЗначение из СоответствиеУведомлений Цикл
	   
	   УведомлениеСсылка = XMLЗначение(Тип("СправочникСсылка.CW_УведомленияСайта"),КлючЗначение.Ключ);    
	   ДанныеУведомления = КлючЗначение.Значение;  
	   ВерсияУведомления = ДанныеУведомления.Получить("Version"); 
	   
	   УведомлениеОбъект = УведомлениеСсылка.ПолучитьОбъект();
	   Если УведомлениеОбъект = Неопределено Тогда  
		   УведомлениеОбъект 	= Справочники.CW_УведомленияСайта.СоздатьЭлемент(); 
		   УведомлениеОбъект.УстановитьСсылкуНового(УведомлениеСсылка); 
	   КонецЕсли;
	   
	   Если ВерсияУведомления <> УведомлениеОбъект.Версия Тогда  

		   УведомлениеОбъект.Наименование 	= ДанныеУведомления.Получить("Name");
		   УведомлениеОбъект.Релиз 			= ДанныеУведомления.Получить("Release");   
		   УведомлениеОбъект.ТекстСообщения	= ДанныеУведомления.Получить("Message");   
		   УведомлениеОбъект.Версия			= ДанныеУведомления.Получить("Version");   
	   
		   Релиз 		= ДанныеУведомления.Получить("Release"); 
		   Релиз 		= ?(Релиз = Неопределено, "0.0.0.0", Релиз);
		   мРазряды 	= СтрРазделить(Релиз,".", ложь);
		   
		   УведомлениеОбъект.Разряд1 = мРазряды[0];
		   УведомлениеОбъект.Разряд2 = мРазряды[1];
		   УведомлениеОбъект.Разряд3 = мРазряды[2];
		   УведомлениеОбъект.Разряд3 = мРазряды[3];
		   
		   СоответствиеВложений = ДанныеУведомления.Получить("Attachments");
		   
		   Вложения = Новый Структура;
		   Для Каждого Вложение из  СоответствиеВложений Цикл  
			   ДвоичныеДанные = Base64Значение(Вложение.Значение);
			   Картинка = Новый Картинка(ДвоичныеДанные);
			   
			   Вложения.Вставить(Вложение.Ключ, Картинка);
		   КонецЦикла;    
		   
		   ТекстHTML = ДанныеУведомления.Получить("TextHTML");   
		   
		   СтрукутраHTML = Новый Структура;
		   СтрукутраHTML.Вставить("ТекстHTML", ТекстHTML);
		   СтрукутраHTML.Вставить("Вложения",  Вложения);
		   
		   УведомлениеОбъект.ХранилищеHTML = Новый ХранилищеЗначения(СтрукутраHTML);  
		   
		   УведомлениеОбъект.Записать();
		   
		   
		   РегистрыСведений.CW_ПрочитанныеУведомления.ОтменитьПрочтениеУведомления(УведомлениеСсылка);
		   
	   КонецЕсли;
	   
   КонецЦикла;
   
КонецПроцедуры                               


Функция ПолучитьURLУведомлений() 
   
   КороткоеИмя = CW_ОбновлениеКонфигурацииСервер.ПолучитьКороткоеИмяКонфигурации();   
   ИмяФайла 	= ПолучитьИмяФайлаУведомлений();   
   
   Если КороткоеИмя = "" или ИмяФайла = "" Тогда
	   Возврат "";
   КонецЕсли;
   
   Возврат "/products/programs_cw/"+КороткоеИмя+"/Messages/"+ИмяФайла;     
   
КонецФункции    

Функция ПолучитьИмяФайлаУведомлений()
	
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляРоссииСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляРоссииСервер");
		Возврат Модуль_CW_БухгалтерияЭкспедитораДляРоссииСервер.ПолучитьИмяФайлаУведомлений();	
	КонецЕсли;
	
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляКазахстана") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляКазахстанаСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляКазахстанаСервер");
		Возврат Модуль_CW_БухгалтерияЭкспедитораДляКазахстанаСервер.ПолучитьИмяФайлаУведомлений();	
	КонецЕсли; 
	
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляБелоруси") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляБеларусиСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляБелорусиСервер");
		Возврат Модуль_CW_БухгалтерияЭкспедитораДляБеларусиСервер.ПолучитьИмяФайлаУведомлений();	
	КонецЕсли;
	
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляУзбекистана") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляУзбекистанаСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляУзбекистанаСервер");
		Возврат Модуль_CW_БухгалтерияЭкспедитораДляУзбекистанаСервер.ПолучитьИмяФайлаУведомлений();	
	КонецЕсли;
	
   Возврат "";
   
КонецФункции

Функция ЕстьНепрочитанныеУведомления() Экспорт
	
	ИмяОсновнойПодсистемы 	= CW_ВерсииПодсистемСервер.ИмяОсновнойПодсистемы();
    ОсновнаяПоставка 		= CW_ВерсииПодсистемСервер.ОсновнаяПоставка();  
	Релиз 					= ОсновнаяПоставка[ИмяОсновнойПодсистемы];
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_УведомленияСайта.Ссылка КАК Ссылка,
	               |	ВЫБОР
	               |		КОГДА CW_ПрочитанныеУведомления.Уведомление ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Прочитано
	               |ИЗ
	               |	Справочник.CW_УведомленияСайта КАК CW_УведомленияСайта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПрочитанныеУведомления КАК CW_ПрочитанныеУведомления
	               |		ПО CW_УведомленияСайта.Ссылка = CW_ПрочитанныеУведомления.Уведомление
	               |			И (CW_ПрочитанныеУведомления.Пользователь = &Пользователь)
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА CW_ПрочитанныеУведомления.Уведомление ЕСТЬ NULL
	               |				ТОГДА ЛОЖЬ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ = ЛОЖЬ
	               |	И CW_УведомленияСайта.ПометкаУдаления = ЛОЖЬ
	               |	И CW_УведомленияСайта.Релиз = &Релиз";  
	
	Запрос.УстановитьПараметр("Пользователь", 	ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Релиз", 			Релиз);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции
